In [13]:
import pandas as pd
import numpy as np

In [14]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [15]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [16]:
df.describe()

         Column1    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [18]:
df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [19]:
df.corr()

         Column1  Column2  Column3  Column4
Column1      1.0      1.0      1.0      1.0
Column2      1.0      1.0      1.0      1.0
Column3      1.0      1.0      1.0      1.0
Column4      1.0      1.0      1.0      1.0

## CSV

In [20]:
from io import StringIO, BytesIO

In [22]:
data = ('col1,col2,col3\n'
         'x,y,1\n'
       'a,b,2\n'
       'c,d,3')

In [23]:
type(data)

str

In [24]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [25]:
df=pd.read_csv(StringIO(data), usecols=['col1','col2'])

In [26]:
df

  col1 col2
0    x    y
1    a    b
2    c    d